---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightInfo.#ctor(System.String)
source: html/334b6fd9-17ef-088b-6266-3e2064549ae1.htm
---
# Autodesk.Revit.DB.ExportLineweightInfo.#ctor Method

Constructs a new ExportLineweightInfo using the destination line weight name as input.

## Syntax (C#)
```csharp
public ExportLineweightInfo(
	string destinationLineweightName
)
```

## Parameters
- **destinationLineweightName** (`System.String`) - The destination line weight name (the name of the line weight in the exported format).

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null